 [
  {
  "name":"Orange Bitters",
  "type":"garnish",
  "description":"Orange bitters is a cocktail flavoring made from the peels of Seville oranges, cardamon, caraway seed, coriander and burnt sugar in an alcohol base. Orange bitters, which are not to be confused with standard Angostura bitters, are currently enjoying a resurgence among cocktail enthusiasts. For many years, it was difficult to find orange bitters in the United States and elsewhere. Because of this, some cocktail recipes which traditionally contained orange bitters may now exclude that ingredient. Fee Brothers of New York has been producing orange bitters for many years, but distribution was limited. There are now a number of different brands on the market."
  },
  {
  "name":"Absinthe",
  "type":"spirit",
  "description":"Absinthe (/ˈæbsɪnθ/ or /ˈæbsænθ/; French: [apsɛ̃t]) is historically described as a distilled, highly alcoholic (45–74% ABV / 90-148 proof) beverage. It is an anise-flavoured spirit derived from botanicals, including the flowers and leaves of Artemisia absinthium (a.k.a. \"grand wormwood\"), together with green anise, sweet fennel, and other medicinal and culinary herbs. Absinthe traditionally has a natural green colour but may also be colourless. It is commonly referred to in historical literature as \"la fée verte\" (the green fairy). Although it is sometimes mistakenly referred to as a liqueur, absinthe is not traditionally bottled with added sugar; it is therefore classified as a spirit. Absinthe is traditionally bottled at a high level of alcohol by volume, but it is normally diluted with water prior to being consumed.\nAbsinthe originated in the canton of Neuchâtel in Switzerland in the late 18th century. It rose to great popularity as an alcoholic drink in late 19th- and early 20th-century France, particularly among Parisian artists and writers. Owing in part to its association with bohemian culture, the consumption of absinthe was opposed by social conservatives and prohibitionists. Ernest Hemingway, Charles Baudelaire, Paul Verlaine, Arthur Rimbaud, Henri de Toulouse-Lautrec, Amedeo Modigliani, Picasso, Vincent van Gogh, Oscar Wilde, Aleister Crowley, Erik Satie, and Alfred Jarry were all known absinthe drinkers.\nAbsinthe has often been portrayed as a dangerously addictive psychoactive drug. The chemical compound thujone, although present in the spirit in only trace amounts, was blamed for its alleged harmful effects. By 1915, absinthe had been banned in the United States and in much of Europe, including France, the Netherlands, Belgium, Switzerland and Austria-Hungary. Although absinthe was vilified, it has not been demonstrated to be any more dangerous than ordinary spirits. Recent studies have shown that the absinthe's psychoactive properties (apart from that of the alcohol) have been exaggerated. A revival of absinthe began in the 1990s, following the adoption of modern European Union food and beverage laws that removed longstanding barriers to its production and sale. By the early 21st century, nearly 200 brands of absinthe were being produced in a dozen countries, most notably in France, Switzerland, Australia, USA, Spain, and the Czech Republic."
  },
  {
  "name":"Raspberry liqueur",
  "type":"liqueur",
  "description":"Chambord Black Raspberry Liqueur (pronounced: [ʃɑ̃.bɔʁ]) is modelled after a raspberry liqueur produced in the Loire Valley of France during the late 17th century. The liqueur was said to have been introduced to Louis XIV during one of his visits to the Château de Chambord. It was common during that time for liqueurs and cognac to be consumed with elegant meals. As of October 2011, the Chambord product brand is owned and produced by the Brown-Forman Corporation.\nChambord is made from red and black raspberries, Madagascar vanilla, Moroccan citrus peel, honey and cognac.\nChambord is produced on the premises of a traditional Loire Valley chateau, using all natural ingredients. Whole raspberries and blackberries are steeped in French spirits for a period of several weeks to produce a fruit infusion. This infusion produces a distinct raspberry flavour and aroma.\nAfter the infusion is extracted, a second set of spirits is added to the fruit and allowed to rest for a few weeks. After this second infusion is drawn off, the remaining fruit is pressed to obtain the natural sugars and juice. The fruit-infused spirits and juices from the final pressing are then combined, and finally, the berry infusion is married with a proprietary blend of cognac, natural vanilla extract, black raspberries, citrus peel, honey, and herbs and spices. The liqueur is 16.5% alcohol by volume.\nChambord comes in a spherical bottle. Through mid-2010, the bottle came with a metallic gold plastic lettered 'belt' around the middle, and a crown atop its lid. The bottle was modeled after a Globus cruciger.\nIn the U.S. market, the manufacturer began using a different bottle design in summer 2010, with modifications to the belt, lid and other elements.\nIn addition to redesigning the bottle for the traditional Chambord liqueur, the manufacturer has also begun using the Chambord brand name on an additional product: a flavoured vodka.\nCommon drinks made from Chambord include the Raspberry Margarita, French Manhattan, Butler Miller (Chambord Vodka Gimlet), Kir Imperial (Chambord and Champagne), Chambord Daiquiri, Chambord Royal Spritzer, Lemonado (Vodka, lemonade and splash of Chambord), Little Purple Men, The Purple Hooter Shooter, Sour Grapes, Black Opal, Peanut Butter and Jelly (w/ Frangelico or Castries Peanut Cream), Grape Crush, French Martini (which started the 'cocktails as a Martini' craze), and the \"Blood of Christ\".\nThe label recommends that, once opened, the bottle be consumed within six months for optimum flavour."
  },
  {
  "name":"Worcestershire sauce",
  "type":"other",
  "description":"Worcestershire sauce (/ˈwʊstərʃər/), usually shortened to Worcester sauce (/ˈwʊstər/), is a fermented liquid condiment. It is often an ingredient in Welsh rarebit, Caesar salad, Oysters Kirkpatrick, and sometimes added to chili con carne, beef stew, hamburgers, and other beef dishes. Worcestershire sauce is also used to flavour cocktails such as a Bloody Mary or Caesar. Known as salsa inglesa (English sauce) in Spanish, it is also an ingredient in Michelada, the Mexican beer cocktail."
  },
  {
  "name":"Sugar",
  "type":"other",
  "description":"Sugar is the generalized name for sweet, short-chain, soluble carbohydrates, many of which are used in food. They are carbohydrates, composed of carbon, hydrogen, and oxygen. There are various types of sugar derived from different sources. Simple sugars are called monosaccharides and include glucose (also known as dextrose), fructose and galactose. The table or granulated sugar most customarily used as food is sucrose, a disaccharide. (In the body, sucrose hydrolyses into fructose and glucose.) Other disaccharides include maltose and lactose. Longer chains of sugars are called oligosaccharides. Chemically-different substances may also have a sweet taste, but are not classified as sugars. Some are used as lower-calorie food substitutes for sugar described as artificial sweeteners.\nSugars are found in the tissues of most plants, but are only present in sufficient concentrations for efficient extraction in sugarcane and sugar beet. Sugarcane is any of several species of giant grass in the genus Saccharum that have been cultivated in tropical climates in South Asia and Southeast Asia since ancient times. A great expansion in its production took place in the 18th century with the layout of sugar plantations in the West Indies and Americas. This was the first time that sugar became available to the common people who previously had to rely on honey to sweeten foods. Sugar beet, a cultivated variety of Beta vulgaris, is grown as a root crop in cooler climates and became a major source of sugar in the 19th century when methods for extracting the sugar became available. Sugar production and trade have changed the course of human history in many ways. It influenced the formation of colonies, the perpetuation of slavery, the transition to indentured labour, the migration of peoples, wars between sugar trade-controlling nations in the 19th century, and the ethnic composition and political structure of the new world.\nThe world produced about 168 million tonnes of sugar in 2011. The average person consumes about 24 kilograms of sugar each year (33.1 kg in industrialised countries), equivalent to over 260 food calories per person, per day.\nSince the latter part of the twentieth century, it has been questioned whether a diet high in sugars, especially refined sugars, is good for human health. Sugar has been linked to obesity, and suspected of, or fully implicated as a cause in the occurrence of diabetes, cardiovascular disease, dementia, macular degeneration, and tooth decay. Numerous studies have been undertaken to try to clarify the position, but with varying results, mainly because of the difficulty of finding populations for use as controls that do not consume, or are largely free of any sugar consumption."
  },
  {
  "name":"Cherry brandy",
  "type":"spirit",
  "description":"Brandy (from brandywine, derived from Dutch brandewijn, \"burning wine\") is a spirit produced by distilling wine. Brandy generally contains 35–60% alcohol by volume (70–120 US proof) and is typically taken as an after-dinner drink. Some brandies are aged in wooden casks, some are coloured with caramel colouring to imitate the effect of aging, and some brandies are produced using a combination of both aging and colouring.\nBrandy is also produced from fermented fruits other than grapes, but these products are typically named eaux-de-vie, especially in France.\nIn some countries, fruit flavouring or some other flavouring may be added to a spirit that is called \"brandy\"."
  },
  {
  "name":"Calvados",
  "type":"spirit",
  "description":"Calvados (French pronunciation: ​[kal.va.dos]) is an apple brandy from the French region of Lower Normandy (Basse-Normandie)."
  },
  {
  "name":"Gin",
  "type":"spirit",
  "description":"Gin is a spirit which derives its predominant flavour from juniper berries (Juniperus communis). From its earliest origins in the Middle Ages, gin has evolved over the course of a millennium from a herbal medicine to an object of commerce in the spirits industry. Gin was developed on the basis of the older Jenever, and became widely popular in Great Britain when William of Orange, leader of the Dutch Republic, occupied the British throne with his wife Mary. Today, the gin category is one of the most popular and widely distributed range of spirits, and is represented by products of various origins, styles, and flavour profiles that all revolve around juniper as a common ingredient.\n\n"
  },
  {
  "name":"Syrup",
  "type":"mixer",
  "description":"In cooking, a syrup or sirup (from Arabic: شراب‎; sharāb, beverage, wine, via Latin: sirupus) is a thick, viscous liquid consisting primarily of a solution of sugar in water, containing a large amount of dissolved sugars but showing little tendency to deposit crystals. The viscosity arises from the multiple hydrogen bonds between the dissolved sugar, which has many hydroxyl (OH) groups, and the water. Syrups can be made by dissolving sugar in water or by reducing naturally sweet juices such as cane juice, sorghum juice, or maple sap. Corn syrup is made from corn starch using an enzymatic process that converts it to sugars. Technically and scientifically, the term syrup is also employed to denote viscous, generally residual, liquids, containing substances other than sugars in solution.\n\n"
  },
  {
  "name":"Coconut milk",
  "type":"mixer",
  "description":"Coconut milk is the liquid that comes from the grated meat of a brown coconut. The colour and rich taste of the milk can be attributed to the high oil content. Most of the fat is saturated fat. Coconut milk is a very popular food ingredient used in Southeast Asia.\n\n"
  },
  {
  "name":"Ginger beer",
  "type":"mixer",
  "description":"Ginger beer is produced in two versions: brewed ginger beer (which includes home-brewed) or a carbonated drink flavored primarily with ginger and sweetened with sugar or artificial sweeteners."
  },
  {
  "name":"Simple cane syrup",
  "type":"mixer",
  "description":"Steen's cane syrup is a traditional American sweetener made by the simple concentration of cane juice through long cooking in open kettles. It is sweeter than molasses because no refined sugar is removed from the product. Produced in Abbeville, Louisiana, by C. S. Steen's Syrup Mill, Inc. since 1910, it is easy to spot by its bright yellow label. Traditional cane syrup is recognized by Slow Food USA in their Ark of Taste as a cherished and endangered slow food product.\n\n"
  },
  {
  "name":"Brandy",
  "type":"spirit",
  "description":"Brandy (from brandywine, derived from Dutch brandewijn, \"burning wine\") is a spirit produced by distilling wine. Brandy generally contains 35–60% alcohol by volume (70–120 US proof) and is typically taken as an after-dinner drink. Some brandies are aged in wooden casks, some are coloured with caramel colouring to imitate the effect of aging, and some brandies are produced using a combination of both aging and colouring.\nBrandy is also produced from fermented fruits other than grapes, but these products are typically named eaux-de-vie, especially in France.\nIn some countries, fruit flavouring or some other flavouring may be added to a spirit that is called \"brandy\"."
  },
  {
  "name":"Créme liqueur",
  "type":"liqueur",
  "description":"A crème liqueur (not to be confused with cream liqueur) is a liqueur that has a great deal of additional sugar added to the point that it has a near-syrup consistency. Unlike cream liqueurs, crème liqueurs include no cream in their ingredients. \"Crème\" in this case refers to the consistency. This category includes crème de cacao (chocolate), crème de menthe (mint), crème de mûre (blackberry), and crème de cassis (black currant)."
  },
  {
  "name":"Framboise",
  "type":"mixer",
  "description":"Framboise (French pronunciation: ​[fʁɑ̃bwaz]) is the French and Turkish word for raspberry, and also the name of alcohol distilled with the fruit."
  },
  {
  "name":"Whiskey",
  "type":"spirit",
  "description":"Whisky or whiskey is a type of distilled alcoholic beverage made from fermented grain mash. Various grains (which may be malted) are used for different varieties, including barley, corn (maize), rye, and wheat. Whisky is typically aged in wooden casks, generally made of charred white oak.\nWhisky is a strictly regulated spirit worldwide with many classes and types. The typical unifying characteristics of the different classes and types are the fermentation of grains, distillation, and aging in wooden barrels."
  },
  {
  "name":"Salt",
  "type":"other",
  "description":"Common salt is a mineral substance composed primarily of sodium chloride (NaCl), a chemical compound belonging to the larger class of ionic salts; salt in its natural form as a crystalline mineral is known as rock salt or halite. Salt is present in vast quantities in the sea where it is the main mineral constituent, with the open ocean having about 35 grams (1.2 oz) of solids per litre, a salinity of 3.5%. Salt is essential for animal life, and saltiness is one of the basic human tastes. The tissues of animals contain larger quantities of salt than do plant tissues; therefore the typical diets of nomads who subsist on their flocks and herds require little or no added salt, whereas cereal-based diets require supplementation. Salt is one of the oldest and most ubiquitous of food seasonings, and salting is an important method of food preservation.\nSome of the earliest evidence of salt processing dates back to around 6,000 years ago, when people living in Romania were boiling spring water to extract the salts; a saltworks in China has been found which dates to approximately the same period. Salt was prized by the ancient Hebrews, the Greeks, the Romans, the Byzantines, the Hittites and the Egyptians. Salt became an important article of trade and was transported by boat across the Mediterranean Sea, along specially built salt roads, and across the Sahara in camel caravans. The scarcity and universal need for salt has led nations to go to war over salt and use it to raise tax revenues. Salt is also used in religious ceremonies and has other cultural significance.\nSalt is produced from salt mines or by the evaporation of seawater or mineral-rich spring water in shallow pools. Its major industrial products are caustic soda and chlorine, and it is used in many industrial processes and in the manufacture of polyvinyl chloride, plastics, paper pulp and many other products. Of the annual production of around two hundred million tonnes of salt, only about 6% is used for human consumption; other uses include water conditioning processes, de-icing highways and agricultural use. Edible salt is sold in forms such as sea salt and table salt which usually contains an anti-caking agent and may be iodised to prevent iodine deficiency. As well as its use in cooking and at the table, salt is present in many processed foods. Too much sodium in the diet raises blood pressure and may increase the risk of heart attacks and strokes. The World Health Organization recommends that adults should consume less than 2,000 mg of sodium which is equivalent to 5 grams of salt per day.\n\n"
  },
  {
  "name":"Vodka",
  "type":"spirit",
  "description":"Vodka (Polish: wódka [ˈvutka], Russian: водка [ˈvotkə]) is a distilled beverage composed primarily of water and ethanol, sometimes with traces of impurities and flavorings. Traditionally, vodka is made by the distillation of fermented grains or potatoes, though some modern brands use other substances, such as fruits or sugar.\nSince the 1890s, the standard Russian, Ukrainian, Estonian, Polish, Latvian, Lithuanian and Czech vodkas are 40% alcohol by volume ABV (80 proof), a percentage attributed to Dimitri Mendeleev. The European Union has established a minimum of 37.5% ABV for any \"European vodka\" to be named as such. Products sold as \"vodka\" in the United States must have a minimum alcohol content of 40%. Even with these loose restrictions, most vodka sold contains 40% ABV. For homemade vodkas and distilled beverages referred to as \"moonshine\", see moonshine by country.\nVodka is traditionally drunk neat and often chilled in the vodka belt countries of Eastern Europe and around the Baltic Sea. It is also commonly used in cocktails and mixed drinks, such as the vodka martini, vodka tonic, Screwdriver, Greyhound, Black or White Russian, Bloody Mary, and Sex on the Beach."
  },
  {
  "name":"Worchestershire sauce",
  "type":"other",
  "description":"Worcestershire sauce (/ˈwʊstərʃər/), usually shortened to Worcester sauce (/ˈwʊstər/), is a fermented liquid condiment. It is often an ingredient in Welsh rarebit, Caesar salad, Oysters Kirkpatrick, and sometimes added to chili con carne, beef stew, hamburgers, and other beef dishes. Worcestershire sauce is also used to flavour cocktails such as a Bloody Mary or Caesar. Known as salsa inglesa (English sauce) in Spanish, it is also an ingredient in Michelada, the Mexican beer cocktail."
  },
  {
  "name":"Peach bitters",
  "type":"garnish",
  "description":""
  },
  {
  "name":"Prosecco",
  "type":"mixer",
  "description":"Prosecco is an Italian sparkling white wine, generally a dry or extra dry wine. It is normally made from Glera (the grape formerly known, itself, as \"Prosecco\") though other varieties, such as Bianchetta Trevigiana, are permitted to be included in the blend.\nAlthough the name is derived from that of the Italian village of Prosecco near Trieste, where the grape may have originated, DOC Prosecco is produced in the regions of Veneto and Friuli Venezia Giulia, traditionally mainly around Conegliano and Valdobbiadene, in the hills north of Treviso.\nProsecco is the main ingredient of the Bellini cocktail and can be a less-expensive substitute for Champagne."
  },
  {
  "name":"Pineapple juice",
  "type":"mixer",
  "description":"The pineapple (Ananas comosus) is a tropical plant with edible multiple fruit consisting of coalesced berries, and the most economically significant plant in the Bromeliaceae family. Pineapples may be cultivated from a crown cutting of the fruit, possibly flowering in 20–24 months and fruiting in the following six months. Pineapple does not ripen significantly post-harvest.\nPineapples are consumed fresh, cooked, juiced, and preserved, and are found in a wide array of cuisines. In addition to consumption, in the Philippines the pineapple's leaves are used to produce the textile fiber piña- employed as a component of wall paper and furnishings, amongst other uses."
  },
  {
  "name":"Drambuie",
  "type":"spirit",
  "description":"Drambuie /dræmˈbuːi/ is a sweet, golden coloured 40% ABV (80-proof) liqueur made from malt whisky, honey, herbs and spices.\nProduced in Broxburn, West Lothian, Scotland, it is served straight, on the rocks, or added to mixed drinks such as the Rusty Nail."
  },
  {
  "name":"White wine",
  "type":"mixer",
  "description":"White wine is a wine whose colour can be straw-yellow, yellow-green, or yellow-gold coloured.\nIt is produced by the alcoholic fermentation of the non-coloured pulp of grapes which may have a white or black skin. It is treated so as to maintain a yellow transparent colour in the final product. The wide variety of white wines comes from the large number of varieties, methods of winemaking, and also the ratio of residual sugar.\nWhite wine has existed for at least 2500 years. It has accompanied economic development and colonized every country whose inhabitants are wine drinkers: Europe, America, Oceania, although less systematically in Africa and Asia due to climate and religious reasons.\nThe white grapes from which white wine is mainly produced are green or yellow of which there are many so that white wine can be produced anywhere that grapes can be grown. Some varieties are well-known such as the Chardonnay B, Sauvignon B, and Riesling B. Others have a discrete existence hidden behind the name of a wine resulting from the assembly of several varieties. Tokay, Sherry, and Sauternes are examples of these. The winemaker can also use a variety with a coloured skin provided she is careful not to stain the wort during the separation of the pulp-juice. The Pinot noir N, for example, is commonly used to produce champagne.\nAmong the many types of white wine, dry white wine is the most common. More or less aromatic and tangy, it is derived from the complete fermentation of the wort. Sweet wines, whether moelleux (Sweet: 12-45 g/l of sugar) or liquoreux (Fortified: >45 g/l sugar) wines are where the fermentation is interrupted before all the grape sugars are converted into alcohol: this is called Mutage or fortification. The methods of enriching wort with sugar are multiple: on-ripening on the vine, passerillage (straining), or the use of Noble rot. Sparkling wines, which are mostly white wines, are wines where the carbon dioxide from the fermentation is kept dissolved in the wine and becomes gas when the bottle is opened giving a delicate foam beverage considered the festive wine par excellence.\nCelebrated by writers, poets, singers and painters, white wine is used as an Apéritif during the meal, with dessert, or as a refreshing drink between meals. They are more refreshing, lighter in both style and taste than the majority of their red wine counterparts, making them ideal for spring and summer occasions. The old guideline of “white wine with white meat” still holds true in many instances, but there are plenty of exceptions and palate preferences that dictate which wines to pair with what foods. As an example, Chardonnay combines well with the taste of fleur de lis (triple cream cheese).\nWhite wine also contributes to the development of dishes in the kitchen thanks to its acidity, aroma, and its ability to soften meat and deglaze the cooking juices. Its benefits to the body are however lower than those attributed to red wine because it is low in Polyphenolic compounds."
  },
  {
  "name":"Benedictine",
  "type":"liqueur",
  "description":"Bénédictine is an herbal liqueur beverage developed by Alexandre Le Grand in the 19th century and produced in France. Every bottle of Bénédictine has the initials D.O.M. on the label, which stands for DeoOptimoMaximo ('ToGod, mostgood, mostgreat'). This abbreviation is commonly used at the beginning of documents of the Benedictine Order as a short dedication of the work."
  },
  {
  "name":"Cognac",
  "type":"spirit",
  "description":"Cognac (/ˈkɒnjæk/ KON-yak ; French pronunciation: ​[kɔ.ɲak]), named after the town of Cognac in France, is a variety of brandy. It is produced in the wine-growing region surrounding the town from which it takes its name, in the French Departements of Charente and Charente-Maritime.\nFor a distilled brandy to bear the name Cognac, an Appellation d'origine contrôlée, its production methods must meet certain legal requirements. In particular, it must be made from specified grapes (see below), of which Ugni blanc, known locally as Saint-Emilion, is the one most widely used. The brandy must be twice distilled in copper pot stills and aged at least two years in French oak barrels from Limousin or Tronçais. Cognac matures in the same way as whiskies and wine when aged in barrels, and most cognacs are aged considerably longer than the minimum legal requirement.\n\n"
  },
  {
  "name":"Sherry",
  "type":"spirit",
  "description":"Sherry (English /ˈʃɛri/, Spanish: Jerez [xeˈɾeθ] or [xeˈɾes]) is a fortified wine made from white grapes that are grown near the town of Jerez de la Frontera in Andalusia, Spain. Sherry is produced in a variety of dry styles made primarily from the Palomino grape, ranging from light versions similar to white table wines, such as Manzanilla and Fino, to darker and heavier versions that have been allowed to oxidise as they age in barrel, such as Amontillado and Oloroso. Sweet dessert wines are also made, from Pedro Ximenez or Moscatel grapes, and are sometimes blended with Palomino-based Sherries.\nThe word \"Sherry\" is an anglicisation of Xeres (Jerez). Sherry was previously known as sack, from the Spanish saca, meaning \"extraction\" from the solera. In Europe, \"Sherry\" has protected designation of origin status, and under Spanish law, all wine labelled as \"Sherry\" must legally come from the Sherry Triangle, an area in the province of Cádiz between Jerez de la Frontera, Sanlúcar de Barrameda, and El Puerto de Santa María. In 1933 the Jerez Denominación de Origen was the first Spanish denominación to be officially recognised in this way, officially named D.O. Jerez-Xeres-Sherry and sharing the same governing council as D.O. Manzanilla Sanlúcar de Barrameda.\nAfter fermentation is complete, the base wines are fortified with grape spirit in order to increase their final alcohol content. Wines classified as suitable for aging as Fino and Manzanilla are fortified until they reach a total alcohol content of 15.5 per cent by volume. As they age in barrel, they develop a layer of flor—a yeast-like growth that helps protect the wine from excessive oxidation. Those wines that are classified to undergo aging as Oloroso are fortified to reach an alcohol content of at least 17 per cent. They do not develop flor and so oxidise slightly as they age, giving them a darker colour. Because the fortification takes place after fermentation, most Sherries are initially dry, with any sweetness being added later. In contrast, Port wine, for example, is fortified halfway through its fermentation, which stops the process so that not all of the sugar is turned into alcohol.\nWines from different years are aged and blended using a solera system before bottling, so that bottles of Sherry will not usually carry a specific vintage year and can contain a small proportion of very old wine. Sherry is regarded by many wine writers as \"underappreciated\" and a \"neglected wine treasure\"."
  },
  {
  "name":"DOM Bénédictine",
  "type":"liqueur",
  "description":"Bénédictine is an herbal liqueur beverage developed by Alexandre Le Grand in the 19th century and produced in France.\nIt is claimed that at the Benedictine Abbey of Fécamp in Normandy, monks had developed a medicinal aromatic herbal beverage which was produced until the abbey's devastation during the French Revolution, but in fact Alexandre Le Grand invented the recipe himself, helped by a local chemist, and he told this story to connect the liqueur with the city history to increase sales.\nHe began production under the trade name \"Bénédictine\", using a bottle with an easily recognizable shape and label. The family eventually sold the company to Martini and Rossi, which was in turn bought by Bacardi.\nThe recipe is a closely guarded trade secret, purportedly known to only three people at any given time. So many people have tried to reproduce it that the company maintains on its grounds in Fécamp a \"Hall of Counterfeits\" (Salle des Contrefaçons). The bottle and label have been imitated, as has the name Bénédictine. The company prosecuted those it felt to be infringing on its intellectual property.\nThe manufacturing process involves several distillations which are then blended.\nThe same company also produces \"B & B\" (or Bénédictine and Brandy), which is Bénédictine diluted with brandy, making it less sweet than Bénédictine. B & B was developed in the 1930s when consumers began a trend of mixing Bénédictine with brandy to produce a drier taste. Both Bénédictine and B&B are 40% alcohol (80 proof) by volume. Until recently, both Bénédictine and B & B were 43% alcohol (86 proof). In 1977, the company introduced a 60 proof (30% alcohol) coffee liqueur, Café Bénédictine, a blend of Bénédictine and a coffee-flavoured liqueur, however, Café Bénédictine is no longer produced or available. Additionally, the company produces a Bénédictine Single Cask. Bénédictine Single Cask comes in a unique black bottle and is only available at the Palais de la Bénédictine's store in Fécamp, Normandy, France.\nEvery bottle of Bénédictine has the initials D.O.M. on the label, which stands for \"Deo Optimo Maximo\" (\"To God, most good, most great\"). This abbreviation is commonly used at the beginning of documents of the Benedictine Order as a short dedication of the work.\nBurnley Miners' Club in Lancashire, United Kingdom is the world's biggest single consumer of Benedictine liqueur, after Lancashire regiments acquired a taste for it during the First World War. Burnley Football Club also sell Benedictine on match days, making them the only English club to do this.\nBesides the B & B, cocktails using Bénédictine include the Frisco, Derby, Singapore Sling, Vieux Carré, Cornell Special, and Monte Carlo."
  },
  {
  "name":"Champagne",
  "type":"mixer",
  "description":"Champagne (French: [ʃɑ̃.paɲ]; English /ˌʃæmˈpeɪn/) is a sparkling wine produced from grapes grown in the Champagne region of France following rules that demand secondary fermentation of the wine in the bottle to create carbonation. Some use the term champagne as a generic term for sparkling wine, but the majority of countries reserve the term exclusively for sparkling wines that come from Champagne and are produced under the rules of the appellation.\nThe primary grapes used in the production of Champagne are black Pinot noir and Pinot Meunier, and white Chardonnay. Champagne appellation law only allows grapes grown according to appellation rules in specifically designated plots within the appellation to be used in the production of Champagne.\nRoyalty became associated with Champagne in the 17th, 18th and 19th century. The leading manufacturers made efforts to associate their Champagnes with nobility and royalty through advertising and packaging, which led to popularity among the emerging well-off middle class."
  },
  {
  "name":"Celery salt",
  "type":"other",
  "description":"Celery salt is a seasoned salt used as a food seasoning, made from ground seeds, which may come from celery or its relative lovage. It may also be produced using dried celery or seed oleoresin."
  },
  {
  "name":"Disaronno",
  "type":"liqueur",
  "description":"Disaronno Originale (28% abv) is a brand of fruity amaretto, with a characteristic bittersweet almond taste. Disaronno claims its \"originale\" amaretto's \"secret formula\" is unchanged from the year 1525, and claims the Luini tale as its own particular history. Its production remains in Saronno, but the product is sold worldwide.\nThe company describes its amaretto as an infusion of \"apricot kernel oil\" with \"absolute alcohol, burnt sugar, and the pure essence of seventeen selected herbs and fruits\"; the product does not contain any almonds or other nuts. The amber liqueur is presented in an oblong glass decanter designed by a craftsman from Murano.\nThe product was called \"Amaretto di Saronno\" (Amaretto from Saronno) before adopting, for marketing reasons, the current name \"Disaronno Originale.\"\nDisaronno can be served on the rocks, in shots, as part of a cocktail or with a mixer such as Coke or apple, mango or cherry juice."
  },
  {
  "name":"Grenadine",
  "type":"other",
  "description":"Grenadine is a commonly used bar syrup, characterized by a flavor that is both tart and sweet, and a deep red color. It is popular as an ingredient in cocktails, both for its flavor and to give a reddish/pink tint to mixed drinks."
  },
  {
  "name":"Campari",
  "type":"liqueur",
  "description":"Campari is an alcoholic liqueur, considered an apéritif (20.5%, 21%, 24%, 25%, or 28% ABV, depending on the country in which it is sold), obtained from the infusion of herbs and fruit (including chinotto and cascarilla) in alcohol and water. It is a bitter characterised by its dark red colour.\nCampari is often used in cocktails and is commonly served with soda water, wine, or citrus juice. It is produced by the Campari Group, a multi-national company based in Italy."
  },
  {
  "name":"Water",
  "type":"other",
  "description":"It's water, preferably of the filtered variety.  That's all you need to know."
  },
  {
  "name":"Yellow Chartreuse",
  "type":"liqueur",
  "description":"Chartreuse (pronounced: [ʃaʁtʁøz]) is a French liqueur made by the Carthusian Monks since 1737 according to the instructions set out in the secret manuscript given to them by François Annibal d'Estrées in 1605. It is composed of distilled alcohol aged with 130 herbs, plants and flowers. The liqueur is named after the Monks' Grande Chartreuse monastery, located in the Chartreuse Mountains in the general region of Grenoble in France. The liqueur is produced in their distillery in the nearby town of Voiron (Isère).\nChartreuse gives its name to the colour chartreuse, which was first used as a term of colour in 1884. It is one of the handful of liquors that continues to age and improve in the bottle."
  },
  {
  "name":"Powdered sugar",
  "type":"other",
  "description":"Powdered sugar is very fine sugar which contains a small amount of anti-caking agent.Confectioners sugar and powdered sugar are two different terms for the exact same type of sugar.\nIn industrial food production, it is used where a quick dissolving sugar is required. Domestically, it is principally used to make icing or frosting and other cake decorations. It is often lightly dusted onto baked goods to add a light sweetness and subtle decoration.\nPowdered sugar is available in different degrees of fineness , most commonly XXX, XXXX, and 10X, with more Xs indicating finer grains. Powdered sugar is generally mixed with cornstarch, wheat flour, or calcium phosphate to improve its flowing ability, and thus it is not generally used to sweeten beverages. Industrial grades without these additives are available. However, icing sugar in the UK does not have cornstarch or wheat flour added.\nOne can make powdered sugar at home by putting normal granulated sugar in a coffee grinder or grinding it by hand in a mortar and pestle.\nCaster sugar (also referred to as superfine or baker's sugar) has a larger particle size, up to approximately half that of granulated sugar.\nSnow powder (or snow sugar) is a non-melting form of icing sugar usually consisting of dextrose, starch and anti-binding agents, useful for retaining its structure when dusted onto cakes or pastries that require refrigeration. It is mostly used for decorative purposes."
  },
  {
  "name":"Southern Comfort",
  "type":"liqueur",
  "description":"Southern Comfort is an American liqueur made from neutral spirits with fruit, spice and whiskey. The brand was originally created by bartender Martin Wilkes Heron in New Orleans in 1874, and is now owned by the Brown-Forman Corporation.\nIn the US Southern Comfort is available as 100 US proof (50% alcohol by volume), 70 US proof (35% alcohol by volume) and 42 US proof (21% alcohol by volume). Southern Comfort Special Reserve, found in duty-free shops, is a blend of Southern Comfort and bourbon, and is 80 US proof (40% alcohol by volume). Southern Comfort Lime, released in the Summer of 2010, is 55 proof (27.5% alcohol by volume)(UK 2013 20% alcohol by volume) and Southern Comfort Bold Black Cherry, released in the Summer of 2012, is 70 proof (35% alcohol by volume).\nSouthern Comfort also produces ready-to-pour cocktails available in the US including Southern Comfort Sweet Tea, Southern Comfort Hurricane and Southern Comfort Lemonade, which are all 30 proof (15% alcohol by volume).\nSouthern Comfort has expanded over the years and has several product offerings globally. Outside the US, Southern Comfort produces single-serve cocktails, including Southern Comfort Lemonade and Lime in the UK and Southern Comfort and Cola in Australia."
  },
  {
  "name":"Strawberry syrup",
  "type":"other",
  "description": ""
  },
  {
  "name":"White rum",
  "type":"spirit",
  "description":"Rum is a distilled alcoholic beverage made from sugarcane byproducts, such as molasses, or directly from sugarcane juice, by a process of fermentation and distillation. The distillate, a clear liquid, is then usually aged in oak barrels. Rum can be referred to in Spanish by descriptors such as ron viejo (\"old rum\") and ron añejo (\"aged rum\").\nThe majority of the world's rum production occurs in the Caribbean and Latin America. Rum is also produced in Austria, Spain, Australia, New Zealand, Fiji, Mexico, Hawaii, the Philippines, India, Reunion Island, Mauritius, South Africa, Taiwan, Japan, the United States and Canada.\nLight rums are commonly used in cocktails, whereas \"golden\" and \"dark\" rums were typically consumed individually (i.e., \"straight\" or \"neat\") or used for cooking, but are now commonly consumed with mixers. Premium rums are also available, made to be consumed either straight or iced.\nRum plays a part in the culture of most islands of the West Indies as well as in the Canadian Maritimes and Newfoundland. This beverage has famous associations with the Royal Navy (where it was mixed with water or beer to make grog) and piracy (where it was consumed as bumbo). Rum has also served as a popular medium of economic exchange, used to help fund enterprises such as slavery, organized crime, and military insurgencies (e.g., the American Revolution and Australia's Rum Rebellion). See Triangular trade.\n\n"
  },
  {
  "name":"Tomato juice",
  "type":"mixer",
  "description":"Tomato juice is a juice made from tomatoes. It is usually used as a beverage, either plain or in cocktails such as a Bloody Mary or Michelada."
  },
  {
  "name":"Tabasco",
  "type":"garnish",
  "description":"Tabasco ( taˈβasko ), officially Free and Sovereign State of Tabasco (Spanish: Estado Libre y Soberano de Tabasco), is one of the 31 states which, with the Federal District, comprise the 32 Federal Entities of Mexico. It is divided in 17 municipalities and its capital city is Villahermosa. It is located in the southeast of the country along the Gulf of Mexico bordering the states of Campeche, Chiapas and Veracruz, as well as the country of Guatemala. Most of the state is covered in rainforest as, unlike most other areas of Mexico, it has plentiful rainfall year round. For this reason, it is also covered in small lakes, wetlands and rivers. The state is subject to major flooding events, with the last occurring in 2007, which affected eighty percent of the state. The state is also home to La Venta, the major site of the Olmec civilization, considered to be the origin of later Mesoamerican cultures. Even though it produces significant quantities of petroleum and natural gas, poverty is still a concern. The state is also the origin of the cocoa bean, from which chocolate is made."
  },
  {
  "name":"Orange Curaçao",
  "type":"liqueur",
  "description":"Curaçao (/ˈkjʊərəsaʊ/ KEWR-ə-sow) is a liqueur flavored with the dried peel of the laraha citrus fruit, grown on the island of Curaçao. A non-native plant similar to an orange, the laraha developed from the sweet Valencia orange transplanted by Spanish explorers. The nutrient-poor soil and arid climate of Curaçao proved unsuitable to Valencia cultivation, resulting in small, bitter fruit of the trees. Although the bitter flesh of the Laraha is all but inedible, the peels are aromatic and flavorful, maintaining much of the essence of the Valencia orange.\nCuraçao liqueur was first developed and marketed by the Senior family in the 19th century. To create the liqueur the laraha peel is dried, bringing out the sweetly fragranced oils. After soaking in a still with alcohol and water for several days, the peel is removed and other spices are added.\n\nThe liqueur has an orange-like flavor with varying degrees of bitterness. It is naturally colorless, but is often given artificial coloring, most commonly blue or orange, which confers an exotic appearance to cocktails and other mixed drinks. Blue color is achieved by adding of food colorant, most often E133 Brilliant Blue.\nSome other liqueurs are also sold as Curaçaos with different flavors added, such as coffee, chocolate, and rum and raisin."
  },
  {
  "name":"Sloe Gin",
  "type":"spirit",
  "description":"Sloe gin is a red liqueur made with gin and sloe (blackthorn) drupes, which are a small fruit relative of the plum. Sloe gin has an alcohol content between 15 and 30 percent by volume. However, the European Union has established a minimum of 25% ABV for sloe gin to be named as such. The traditional way of making sloe gin is to soak the sloes in gin. Sugar is required to ensure the sloe juice is extracted from the fruit.\nMany commercial sloe gins today are made by flavouring less expensive neutral grain spirits, although some manufacturers still use the traditional method."
  },
  {
  "name":"Simple syrup",
  "type":"other",
  "description":"In cooking, a syrup or sirup (from Arabic: شراب‎; sharāb, beverage, wine, via Latin: sirupus) is a thick, viscous liquid consisting primarily of a solution of sugar in water, containing a large amount of dissolved sugars but showing little tendency to deposit crystals. The viscosity arises from the multiple hydrogen bonds between the dissolved sugar, which has many hydroxyl (OH) groups, and the water. Syrups can be made by dissolving sugar in water or by reducing naturally sweet juices such as cane juice, sorghum juice, or maple sap. Corn syrup is made from corn starch using an enzymatic process that converts it to sugars. Technically and scientifically, the term syrup is also employed to denote viscous, generally residual, liquids, containing substances other than sugars in solution.\n\n"
  },
  {
  "name":"Aperol",
  "type":"spirit",
  "description":"Aperol is an Italian aperitif originally produced by the Barbieri company, based in Padua. Aperol is now produced by the Campari company. While Aperol was originally created in 1919, it did not become successful until after World War II. Its ingredients are, among others, bitter orange, gentian, rhubarb, and cinchona.\nAlthough it tastes and smells much like Campari, Aperol has an alcohol content of 11%—less than half of Campari. Aperol and Campari have the same sugar content. However, Aperol is milder and less bitter. Campari is also much darker in color.\nAperol to be sold in Germany has an alcohol content of 15% to avoid German container deposit legislation regulations.\nSpritz, an aperitif cocktail, is often made using Aperol."
  },
  {
  "name":"Clear honey",
  "type":"other",
  "description":"Honey /ˈhʌni/ is a sweet food made by bees using nectar from flowers. The variety produced by honey bees (the genus Apis) is the one most commonly referred to, as it is the type of honey collected by most beekeepers and consumed by people. Honeys produced by other bees (bumblebees, stingless bees) and other hymenoptera insects (e. g. honey wasps) have different properties, and they are not discussed in this article.\nHoney bees transform nectar into honey by a process of regurgitation and evaporation. They store it as a primary food source in wax honeycombs inside the beehive.\nHoney gets its sweetness from the monosaccharides fructose and glucose, and has approximately the same relative sweetness as granulated sugar. It has attractive chemical properties for baking and a distinctive flavor that leads some people to prefer it over sugar and other sweeteners. Most microorganisms do not grow in honey because of its low water activity of 0.6. However, honey sometimes contains dormant endospores of the bacterium Clostridium botulinum, which can be dangerous to infants, as the endospores can transform into toxin-producing bacteria in infants' immature intestinal tracts, leading to illness and even death.\nHoney has had a long history in human consumption, and is used in various foods and beverages as a sweetener and flavoring. It also has a role in religion and symbolism. Flavors of honey vary based on the nectar source, and various types and grades of honey are available. It has also been used in various medicinal traditions to treat ailments. The study of pollens and spores in raw honey (melissopalynology) can determine floral sources of honey. Bees carry an electrostatic charge whereby they attract other particles in addition to pollen, which become incorporated into their honey; the honey can be analysed by the techniques of melissopalynology in area environmental studies of radioactive particles, dust and particulate pollution."
  },
  {
  "name":"Orange bitters",
  "type":"garnish",
  "description":"Orange bitters is a cocktail flavoring made from the peels of Seville oranges, cardamon, caraway seed, coriander and burnt sugar in an alcohol base. Orange bitters, which are not to be confused with standard Angostura bitters, are currently enjoying a resurgence among cocktail enthusiasts. For many years, it was difficult to find orange bitters in the United States and elsewhere. Because of this, some cocktail recipes which traditionally contained orange bitters may now exclude that ingredient. Fee Brothers of New York has been producing orange bitters for many years, but distribution was limited. There are now a number of different brands on the market."
  },
  {
  "name":"Honey whiskey",
  "type":"liqueur",
  "description":"Evan Williams is a brand of bourbon whiskey bottled in Bardstown, Kentucky by the Heaven Hill company. The product is aged for a minimum of four years."
  },
  {
  "name":"Sugar cube",
  "type":"other",
  "description":"Sugar is the generalized name for sweet, short-chain, soluble carbohydrates, many of which are used in food. They are carbohydrates, composed of carbon, hydrogen, and oxygen. There are various types of sugar derived from different sources. Simple sugars are called monosaccharides and include glucose (also known as dextrose), fructose and galactose. The table or granulated sugar most customarily used as food is sucrose, a disaccharide. (In the body, sucrose hydrolyses into fructose and glucose.) Other disaccharides include maltose and lactose. Longer chains of sugars are called oligosaccharides. Chemically-different substances may also have a sweet taste, but are not classified as sugars. Some are used as lower-calorie food substitutes for sugar described as artificial sweeteners.\nSugars are found in the tissues of most plants, but are only present in sufficient concentrations for efficient extraction in sugarcane and sugar beet. Sugarcane is any of several species of giant grass in the genus Saccharum that have been cultivated in tropical climates in South Asia and Southeast Asia since ancient times. A great expansion in its production took place in the 18th century with the layout of sugar plantations in the West Indies and Americas. This was the first time that sugar became available to the common people who previously had to rely on honey to sweeten foods. Sugar beet, a cultivated variety of Beta vulgaris, is grown as a root crop in cooler climates and became a major source of sugar in the 19th century when methods for extracting the sugar became available. Sugar production and trade have changed the course of human history in many ways. It influenced the formation of colonies, the perpetuation of slavery, the transition to indentured labour, the migration of peoples, wars between sugar trade-controlling nations in the 19th century, and the ethnic composition and political structure of the new world.\nThe world produced about 168 million tonnes of sugar in 2011. The average person consumes about 24 kilograms of sugar each year (33.1 kg in industrialised countries), equivalent to over 260 food calories per person, per day.\nSince the latter part of the twentieth century, it has been questioned whether a diet high in sugars, especially refined sugars, is good for human health. Sugar has been linked to obesity, and suspected of, or fully implicated as a cause in the occurrence of diabetes, cardiovascular disease, dementia, macular degeneration, and tooth decay. Numerous studies have been undertaken to try to clarify the position, but with varying results, mainly because of the difficulty of finding populations for use as controls that do not consume, or are largely free of any sugar consumption."
  },
  {
  "name":"Tequila",
  "type":"spirit",
  "description":"Tequila (Spanish pronunciation: [teˈkila]) is a regional specific name for a distilled beverage made from the blue agave plant, primarily in the area surrounding the city of Tequila, 65 km (40 mi) northwest of Guadalajara, and in the highlands (Los Altos) of the north western Mexican state of Jalisco. Although tequila is a kind of mezcal, modern tequila differs somewhat in the method of its production, in the use of only blue agave plants, as well as in its regional specificity.\nThe red volcanic soil in the surrounding region is particularly well suited to the growing of the blue agave, and more than 300 million of the plants are harvested there each year. Agave tequila grows differently depending on the region. Blue agaves grown in the highlands region are larger in size and sweeter in aroma and taste. Agaves harvested in the lowlands, on the other hand, have a more herbaceous fragrance and flavor.\nMexican laws state that tequila can be produced only in the state of Jalisco and limited regions in the states of Guanajuato, Michoacán, Nayarit, and Tamaulipas. The United States officially recognizes that spirits called \"tequila\" can only be produced in Mexico, although by agreement bulk amounts can be shipped to be bottled in the U.S.\nTequila is most often made at a 38–40% alcohol content (76–80 proof), but can be produced between 31 and 55% alcohol content (62 and 110 proof)."
  },
  {
  "name":"Lemon juice",
  "type":"other",
  "description":"The lemon (Citrus × limon) is a small evergreen tree native to Asia. The tree's ellipsoidal yellow fruit is used for culinary and non-culinary purposes throughout the world, primarily for its juice, though the pulp and rind (zest) are also used in cooking and baking. The juice of the lemon is about 5% to 6% citric acid, which gives lemons a sour taste. The distinctive sour taste of lemon juice makes it a key ingredient in drinks and foods such as lemonade."
  },
  {
  "name":"Cola",
  "type":"mixer",
  "description":"Cola is a carbonated beverage that originally contained caffeine from the kola nut and cocaine from coca leaves, and was flavored with vanilla and other ingredients. Most colas now use other flavoring (and caffeinating) ingredients with a similar taste and no longer contain cocaine. It became popular worldwide after pharmacist John Pemberton invented Coca-Cola in 1886. His non-alcoholic recipe was inspired by the Coca wine of pharmacist Angelo Mariani, created in 1863. Coca-Cola is a major international brand. It usually contains caramel color, caffeine and sweeteners such as sugar or high fructose corn syrup.\n\n"
  },
  {
  "name":"Club soda",
  "type":"mixer",
  "description":"Carbonated water (also known as club soda, soda water, sparkling water, seltzer water (and Selters), or fizzy water) is water into which carbon dioxide gas under pressure has been dissolved. This process, known as carbonation, is a process that causes the water to become effervescent. For people who enjoy drinking soft drinks, carbonated water can provide a calorie- and sugar-free substitute. The vast majority of carbonated water are sold in ready to drink bottles like mineral water or carbonated beverages such as soft drinks, but it is easy to prepare at home with soda makers."
  },
  {
  "name":"Grapefruit juice",
  "type":"mixer",
  "description":"Grapefruit juice is the fruit juice from grapefruits. It is rich in Vitamin C and ranges from sweet-tart to very sour. Variations include white grapefruit, pink grapefruit and ruby red grapefruit juice."
  },
  {
  "name":"Elderflower liqueur",
  "type":"liqueur",
  "description":"Sambucus (elder or elderberry) is a genus of flowering plants in the family Adoxaceae. It was formerly placed in the honeysuckle family, Caprifoliaceae, but was reclassified due to genetic evidence. It contains between 5 and 30 species of deciduous shrubs, small trees and herbaceous perennial plants.\nThe genus occurs in temperate to subtropical regions of the world. More widespread in the Northern Hemisphere, its Southern Hemisphere occurrence is restricted to parts of Australasia and South America. Many species are widely cultivated for their ornamental leaves, flowers and fruit.\nThe leaves are pinnate with 5–9 leaflets (rarely 3 or 11). Each leaf is 5–30 cm (2.0–11.8 in) long, and the leaflets have serrated margins. They bear large clusters of small white or cream-colored flowers in late spring; these are followed by clusters of small black, blue-black, or red berries (rarely yellow or white)."
  },
  {
  "name":"Espresso",
  "type":"other",
  "description":"Espresso (/ɛˈsprɛsoʊ/; Italian pronunciation: [eˈsprɛsso]) is coffee brewed by forcing a small amount of nearly boiling water under pressure through finely ground coffee beans. Espresso is generally thicker than coffee brewed by other methods, has a higher concentration of suspended and dissolved solids, and has crema on top (a foam with a creamy consistency). As a result of the pressurized brewing process, the flavors and chemicals in a typical cup of espresso are very concentrated. Espresso is the base for other drinks, such as a caffè latte, cappuccino, caffè macchiato, cafe mocha, or caffè Americano. Espresso has more caffeine per unit volume than most coffee beverages, but because the usual serving size is much smaller, the total caffeine content is less. Although the actual caffeine content of any coffee drink varies by size, bean origin, roast method and other factors, the caffeine content of \"typical\" servings of espresso vs. drip brew are 53 mg  vs. 95 to 200 mg."
  },
  {
  "name":"Triple sec",
  "type":"liqueur",
  "description":"Triple sec, originally Curaçao triple sec, is a variety of Curaçao liqueur, an orange-flavoured liqueur made from the dried peels of bitter and sweet orange.\nTriple sec may be consumed neat as a digestif or on the rocks, but is more likely to be used as an ingredient in a variety of cocktails such as the Margarita, White Lady, Long Island Iced Tea, and Cosmopolitan."
  },
  {
  "name":"Blackberry liqueur",
  "type":"liqueur",
  "description":"Lucas Bols B.V. is a privately held Dutch company in the business of production, distribution, sales and marketing of alcoholic beverages. It is the oldest distillery brand in the world. Its brand portfolio consists of Bols, Galliano, Vaccari, Pisang Ambon, Gold Strike and a large group of Dutch genevers and liqueurs. It produces about 3 million cases a year, with yearly revenues exceeding 95 million euros."
  },
  {
  "name":"Vermouth",
  "type":"liqueur",
  "description":"Vermouth (UK /ˈvɜrməθ/; or US /vərˈmuːθ/ ver-MOOTH) is an aromatized fortified wine flavored with various botanicals (roots, barks, flowers, seeds, herbs, spices). The modern versions of the beverage were first produced in the mid to late 18th century in Turin, Italy. While vermouth was traditionally used for medicinal purposes, its true claim to fame is as an aperitif, with fashionable cafes in Turin serving it to guests around the clock. However, in the late 1800s it became popular with bartenders as a key ingredient in many classic cocktails that have survived to date, such as the Martini, the Manhattan and the Negroni. In addition to being consumed as an aperitif or cocktail ingredient, vermouth is sometimes used as an alternative white wine in cooking.\nHistorically, there have been two main types of vermouth, sweet and dry. Resulting from demand and competition, vermouth manufacturers (e.g., Noilly Prat and Cinzano) have created additional styles, including extra-dry white, sweet white (bianco), red, amber (ambre or rosso), and rosé. Vermouth is produced by starting with a base of a neutral grape wine or unfermented wine must. Each manufacturer adds additional alcohol and a proprietary mixture of dry ingredients, consisting of aromatic herbs, roots, and barks, to the base wine, base wine plus spirit or spirit only - which may be redistilled before adding to the wine or unfermented wine must. After the wine is aromatized and fortified, the vermouth is sweetened with either cane sugar or caramelized sugar, depending on the style. Italian and French companies produce most of the vermouth consumed throughout the world, though recently the United States and even England have started production."
  },
  {
  "name":"Cranberry juice",
  "type":"mixer",
  "description":"Cranberry juice is the juice of the cranberry. The term, used on its own, usually refers to a sweetened version. Bear in mind that the information below regarding sugar content applies ONLY to sweetened versions of cranberry juice. Unsweetened juice is available at many grocery stores and contains about 70 calories per cup."
  },
  {
  "name":"Lime juice",
  "type":"other",
  "description":"Lime (from Arabic and French lim) is a term referring to a citrus fruit which is typically round, green, 3–6 cm in diameter, and containing sour (acidic) pulp. There are several species of citrus trees whose fruits are called limes, including the Key lime, Persian lime, kaffir lime, and desert lime. Limes are a good source of vitamin C, and are often used to accent the flavours of foods and beverages. They are grown year-round and are usually smaller and less sour than lemons.\n\n"
  },
  {
  "name":"Pepper",
  "type":"garnish",
  "description":"Regular ol' pepper."
  },
  {
  "name":"Vanilla extract",
  "type":"other",
  "description":"Vanilla extract is a solution containing the flavor compound vanillin as the primary ingredient. Pure vanilla extract is made by macerating and percolating vanilla beans in a solution of ethyl alcohol and water. In the United States, in order for a vanilla extract to be called pure, the U.S. Food and Drug Administration requires that the solution contains a minimum 35% of alcohol and 100g of vanilla beans per litre (13.35 ounces per gallon). Double and triple strength (up to 20-fold) vanilla extracts are available.\nVanilla extract is the most common form of vanilla used today. Mexican, Tahitian, Indonesian and Bourbon vanilla are the main varieties. Bourbon vanilla is named for the period when the island of Réunion was ruled by the Bourbon kings of France; it does not contain Bourbon whiskey.\nNatural vanilla flavoring is derived from real vanilla beans with little to no alcohol. The maximum amount of alcohol that is usually present is only 2–3%. Imitation vanilla extract contains vanillin, made either from guaiacol or from lignin, a byproduct of the wood pulp industry."
  },
  {
  "name":"Scotch whiskey",
  "type":"spirit",
  "description":"Scotch whisky, often simply called Scotch, is malt whisky or grain whisky made in Scotland. Scotch whisky must be made in a manner specified by law.\nAll Scotch whisky was originally made from malted barley. Commercial distilleries began introducing whisky made from wheat and rye in the late 18th century. Scotch whisky is divided into five distinct categories: single malt Scotch whisky, single grain Scotch whisky, blended malt Scotch whisky (formerly called \"vatted malt\" or \"pure malt\"), blended grain Scotch whisky, and blended Scotch whisky.\nAll Scotch whisky must be aged in oak barrels for at least three years. Any age statement on a bottle of Scotch whisky, expressed in numerical form, must reflect the age of the youngest whisky used to produce that product. A whisky with an age statement is known as guaranteed-age whisky.\nThe first written mention of Scotch whisky is in the Exchequer Rolls of Scotland, 1495. A friar named John Cor was the distiller at Lindores Abbey in the Kingdom of Fife.\nMany Scotch whisky drinkers will refer to a unit for drinking as a dram."
  },
  {
  "name":"Cherry liqueur",
  "type":"liqueur",
  "description":"Peter Heering is a Danish manufacturer of liqueurs, most famous for Heering Cherry Liqueur, a liqueur flavored with cherries which is often referred to simply as Peter Heering or Cherry Heering in cocktail recipes. Heering Cherry Liqueur, purveyor to the Royal Danish Court and to H.M. Queen Elizabeth II, has been produced since 1818. It is sold in more than 100 countries. Heering Cherry Liqueur is an ingredient in many cocktails such as the Singapore Sling, and Blood & Sand.\nCherry Heering is used in baking which evaporates some of the alcohol."
  },
  {
  "name":"Pisco",
  "type":"spirit",
  "description":"Pisco is a colorless or yellowish-to-amber colored grape brandy produced in winemaking regions of Chile and Peru. Pisco was developed by Spanish settlers in the 16th century as an alternative to orujo, a pomace brandy that was being imported from Spain. In 2013, the annual production reached 100 million liters in Chile and 7,2 million liters in Peru."
  },
  {
  "name":"Onion",
  "type":"other",
  "description":"The onion (Allium cepa) (Latin 'cepa' = onion), also known as the bulb onion or common onion, is used as a vegetable and is the most widely cultivated species of the genus Allium. This genus also contains several other species variously referred to as onions and cultivated for food, such as the Japanese bunching onion (A. fistulosum), the Egyptian onion (A. ×proliferum), and the Canada onion (A. canadense). The name \"wild onion\" is applied to a number of Allium species but A. cepa is exclusively known from cultivation and its ancestral wild original form is not known, although escapes from cultivation have become established in some regions. The onion is most frequently a biennial or a perennial plant, but is usually treated as an annual and harvested in its first growing season.\nThe onion plant has a fan of hollow, bluish-green leaves and the bulb at the base of the plant begins to swell when a certain day-length is reached. In the autumn the foliage dies down and the outer layers of the bulb become dry and brittle. The crop is harvested and dried and the onions are ready for use or storage. The crop is prone to attack by a number of pests and diseases, particularly the onion fly, the onion eelworm and various fungi that cause rotting. Some varieties of A. cepa such as shallots and potato onions produce multiple bulbs.\nOnions are cultivated and used around the world. As a foodstuff they are usually served cooked, as a vegetable or part of a prepared savoury dish, but can also be eaten raw or used to make pickles or chutneys. They are pungent when chopped and contain certain chemical substances which irritate the eyes. Onions contain phenolics and flavonoids that have potential anti-inflammatory, anti-cholesterol, anticancer and antioxidant properties."
  },
  {
  "name":"Peach schnapps",
  "type":"liqueur",
  "description":"Schnapps (/ʃnɑːps/ or /ʃnæps/; [ʃnaps] ( )) is a term that refers to any kind of strong alcoholic beverage. The English word \"schnapps\" is derived from the German Schnaps (plural, Schnäpse).\nSchnaps is a Low German noun that means \"swallow\"; it has been documented in its High German meaning since before the 18th century."
  },
  {
  "name":"Cachaca",
  "type":"spirit",
  "description":"Cachaça (Portuguese pronunciation: [kaˈʃasɐ]) is a distilled spirit made from sugarcane juice. Also known as aguardente, pinga, caninha or other names, it is the most popular distilled alcoholic beverage in Brazil. Outside Brazil, cachaça is used almost exclusively as an ingredient in tropical drinks, with the caipirinha being the most famous cocktail."
  },
  {
  "name":"Agave nectar",
  "type":"other",
  "description":"Agave nectar (more accurately called agave syrup, as \"nectar\" is a marketing term) is a sweetener commercially produced from several species of agave, including Agave tequilana (blue agave) and Agave salmiana. Agave syrup is sweeter than honey and tends to be less viscous. Most agave syrup comes from Mexico and South Africa.\nAgave syrup has been marketed as a \"healthful\" sweetener, but this fact has been the subject of criticism due to its very high fructose content (which is even more than high fructose corn syrup in its fructose content by weight) and its potential to lead to insulin resistance and significantly increased triglyceride levels (a risk factor for heart disease).\n\n"
  },
  {
  "name":"Kirsch",
  "type":"liqueur",
  "description":"A kirschwasser (/ˈkɪərʃvɑːsər/ KEERSH-vahs-ər; German: [ˈkɪɐ̯ʃvasɐ], German for “cherry water”) or kirsch is a clear, colorless fruit brandy traditionally made from double distillation of morello cherries, a dark-colored cultivar of the sour cherry. However, it is now also made from other kinds of cherries. The cherries are fermented complete (that is, including their stones). Unlike cherry liqueurs and so-called “cherry brandies”, kirschwasser is not sweet.\nThe best kirschwassers have a refined taste with subtle flavors of cherry and a slight bitter-almond taste that derives from the stones."
  },
  {
  "name":"Maraschino",
  "type":"liqueur",
  "description":"Maraschino (/ˌmærəˈskiːnoʊ/ marr-ə-SKEE-noh) is a liqueur from the city of Zadar in Dalmatia, obtained from the distillation of Marasca cherries. The small, slightly sour fruit of the marasca cherry tree (cerasus acidior), which grows wild along parts of the Dalmatian coast, lends the liqueur its unique aroma."
  },
  {
  "name":"Kiwi slice",
  "type":"garnish",
  "description":"The kiwifruit or Chinese gooseberry (often shortened to kiwi), is the edible berry of a woody vine in the genus Actinidia.\nThe most common cultivar group of kiwifruit ('Hayward') is oval, about the size of a large hen's egg (5–8 cm (2.0–3.1 in) in length and 4.5–5.5 cm (1.8–2.2 in) in diameter). It has a fibrous, dull greenish-brown skin and bright green or golden flesh with rows of tiny, black, edible seeds. The fruit has a soft texture and a sweet but unique flavor, and today is a commercial crop in several countries, such as Italy, New Zealand, Chile, Greece, and France."
  },
  {
  "name":"Dash of cola",
  "type":"mixer",
  "description":"A Long Island Iced Tea is a type of alcoholic mixed drink made with, among other ingredients, vodka, gin, tequila, and rum. A popular version mixes equal parts vodka, gin, tequila, rum, and triple sec with 1½ parts sour mix and a splash of cola, which gives the drink the same amber hue as iced tea. Most variants use equal parts of the main liquors but include a smaller amount of triple sec (or other orange-flavored liqueur). Close variants often replace the sour mix with lemon juice, replace the cola with actual iced tea, or add white crème de menthe; however, most variants do not include any tea, despite the name of the drink. Some restaurants substitute brandy for the tequila.\nThe drink has a much higher alcohol concentration (approximately 22 percent) than most highball drinks due to the relatively small amount of mixer. Long islands can be ordered \"extra long\", which further increases the alcohol to mixer ratio."
  },
  {
  "name":"Cream",
  "type":"other",
  "description":"Cream is a dairy product that is composed of the higher-butterfat layer skimmed from the top of milk before homogenization. In un-homogenized milk, the fat, which is less dense, will eventually rise to the top. In the industrial production of cream, this process is accelerated by using centrifuges called \"separators\". In many countries, cream is sold in several grades depending on the total butterfat content. Cream can be dried to a powder for shipment to distant markets.\nCream skimmed from milk may be called \"sweet cream\" to distinguish it from whey cream skimmed from whey, a by-product of cheese-making. Whey cream has a lower fat content and tastes more salty, tangy and \"cheesy\".\nCream produced by cattle (particularly Jersey cattle) grazing on natural pasture often contains some natural carotenoid pigments derived from the plants they eat; this gives the cream a slight yellow tone, hence the name of the yellowish-white color, cream. Cream from goat's milk, or from cows fed indoors on grain or grain-based pellets, is white."
  },
  {
  "name":"Mezcal",
  "type":"spirit",
  "description":"Mezcal, or mescal, (/mɛsˈkæl/) is a distilled alcoholic beverage made from the maguey plant (a form of agave, Agave americana) native to Mexico. The word mezcal comes from Nahuatl mexcalli [meʃˈkalːi] metl [met͡ɬ] and ixcalli [iʃˈkalːi] which means \"oven-cooked agave\".\nThe maguey grows in many parts of Mexico, though most mezcal is made in Oaxaca. There is a saying attributed to Oaxaca regarding the drink: \"para todo mal, mezcal, y para todo bien también\" (\"for everything bad, mezcal; for everything good, the same\").\nIt is unclear whether distilled drinks were produced in Mexico before the Spanish Conquest. The Spaniards were introduced to native fermented drinks such as pulque, also made from the maguey plant. Soon the conquistadors began experimenting with the maguey plant to find a way to make a distillable fermented mash. The result was mezcal.\nToday, mezcal is still made from the heart of the maguey plant, called the \"piña\", much the same way it was 200 years ago, in most places. In Mexico, mezcal is generally consumed straight and has a strong smoky flavor. Though mezcal is not as popular as tequila (a mezcal made specifically from the blue agave in select regions of the country), Mexico does export the product, mostly to Japan and the United States, and exports are growing.\nDespite the similar name, mezcal does not contain mescaline or other psychedelic substances."
  },
  {
  "name":"Rye",
  "type":"spirit",
  "description":"Rye (Secale cereale) is a grass grown extensively as a grain and as a forage crop. It is a member of the wheat tribe (Triticeae) and is closely related to barley (Hordeum) and wheat (Triticum). Rye grain is used for flour, rye bread, rye beer, crisp bread, some whiskeys, some vodkas, and animal fodder. It can also be eaten whole, either as boiled rye berries, or by being rolled, similar to rolled oats.\nRye is a cereal grain and should not be confused with ryegrass, which is used for lawns, pasture, and hay for livestock."
  },
  {
  "name":"Coffee liqueur",
  "type":"liqueur",
  "description":"Liqueurs are alcoholic beverages that are bottled with added sugar and have added flavors that are usually derived from fruits, herbs, or nuts.\nLiqueurs are distinct from eaux-de-vie, fruit brandy, and flavored liquors, which contain no added sugar.\nMost liqueurs range between 15% and 55% alcohol by volume."
  },
  {
  "name":"Angostura bitters",
  "type":"garnish",
  "description":"Angostura bitters is a concentrated bitters, or botanically infused alcoholic mixture, made of water, 44.7% alcohol, herbs and spices, by House of Angostura in Trinidad and Tobago. It is typically used for flavouring beverages, or (less often) food. The bitters were first produced in the town of Angostura (Ciudad Bolívar, Venezuela) (hence the name), and do not contain angostura bark. The bottle is easily recognisable by its distinctive over-sized label."
  },
  {
  "name":"Orange flower water",
  "type":"garnish",
  "description":"Orange flower water, or orange blossom water, is the clear, perfumed by-product of the distillation of fresh bitter-orange blossoms for their essential oil.\nThis essential water has traditionally been used as aromatizer in many Mediterranean traditional dessert dishes, such as in France for the gibassier and pompe à l'huile or in Spain for the Roscón de Reyes (King cake), but has more recently found its way into Western cuisine. For example, orange flower water is used in Europe to flavor madeleines, in Mexico to flavor little wedding cakes and Pan de muerto, and in the United States to make orange blossom scones and marshmallows. Orange flower water is also used as an ingredient in some cocktails, such as the Ramos Gin Fizz.\nIt has been a traditional ingredient used often in North African as well as in Middle Eastern cooking. In Arab variants of baklava, orange blossom water is often mixed with the sweet syrup for flavor. Orange blossoms are believed to be used in this manner because they are seen as the traditional bridal flower and, therefore, symbolize purity (white, small and delicate). It is also added to plain water in the Middle East to mask high mineral content and other unpleasant flavors (e.g. those arising from storage in a qulla, a type of clay jug that keeps water cool in a manner similar to the zeer); some add the fragrance irrespective of the taste of the plain water.\nThere are many brands available that are made in North Africa, Europe and the Middle East. There are also several brands made in Canada and in the United States.\nIn Greece and Cyprus orange blossom water is called anthonero (ανθόνερο) while in Malta it is known as Ilma Żahar.\nIn Morocco orange blossom water is called Ilma Zhar, in Moroccan Arabic meaning \"orange blossom water,\"  in contrast to Ilma Ward, which is rose blossom water. Orange blossom water serves two purposes in Morocco. One usage is a perfume or freshener, usually given to guests to wash their hands upon entering the host house or before drinking tea, in a special silver or metal container; recognizable in the Moroccan tea set. but this old custom is fading away in the present day. The main usage of orange blossom water, however, is in Moroccan cuisine, especially as an ingredient for traditional sweets. In the Middle Eastern countries the Orange blossom water is widely used as medicine and given to babies for tummy ache caused by gas in the stomach. Adults also take it for the same purpose."
  },
  {
  "name":"Cynar",
  "type":"liqueur",
  "description":"Cynar [tʃiˈnar] is an Italian bitter liqueur made from 13 herbs and plants. Predominant amongst these is the artichoke (Cynara scolymus), from which the drink derives its name. Cynar is dark brown in color, has a bittersweet flavor, and its strength is 16.5% ABV.\nCynar can be taken as either an aperitif (generally over ice), or as a cocktail (mixed with soda water and lemon or orange slice, or with cola, eggnog, tonic water, milk or bitter lemon soda). Europeans often mix it with orange juice, especially in Switzerland and Southern Germany where Cynar and orange juice is a very popular combination. A variation of the Negroni cocktail uses Cynar in place of Campari. Because of its artichoke component, Cynar is also regarded as a digestif, as well as an apéritif.\nSince 1995 Cynar has been manufactured and distributed by the Campari Group."
  },
  {
  "name":"Ginger ale",
  "type":"mixer",
  "description":"Ginger ale is a carbonated soft drink flavored with ginger in one of two ways. The golden style is closer to the ginger beer original, and is credited to the American doctor Thomas Cantrell. The dry style (also called the pale style) is a paler drink with a much milder ginger-flavor to it, and was created by Canadian John McLaughlin.\n\n"
  },
  {
  "name":"Cream liqueur",
  "type":"liqueur",
  "description":"Liqueurs are alcoholic beverages that are bottled with added sugar and have added flavors that are usually derived from fruits, herbs, or nuts.\nLiqueurs are distinct from eaux-de-vie, fruit brandy, and flavored liquors, which contain no added sugar.\nMost liqueurs range between 15% and 55% alcohol by volume."
  },
  {
  "name":"Irish cream liqueur",
  "type":"liqueur",
  "description":"Irish cream is a cream liqueur based on Irish whiskey, cream, and other ingredients such as coffee, which can be served on its own or used in mixed drinks or as part of a shot or a whole shot. Irish cream is very popular in the United Kingdom, Canada, and the United States.\nIrish cream typically has between 15 to 20% alcohol by volume (ABV). Some notable brands of Irish cream are Baileys, Carolans, Brogans and Saint Brendan's."
  },
  {
  "name":"Apricot brandy",
  "type":"spirit",
  "description":"Apricot brandy can refer to a liquor (or Eau de Vie) distilled from fermented apricot juice or a liqueur made from apricot flesh and kernels."
  },
  {
  "name":"White sugar",
  "type":"other",
  "description":"Sugar is the generalized name for sweet, short-chain, soluble carbohydrates, many of which are used in food. They are carbohydrates, composed of carbon, hydrogen, and oxygen. There are various types of sugar derived from different sources. Simple sugars are called monosaccharides and include glucose (also known as dextrose), fructose and galactose. The table or granulated sugar most customarily used as food is sucrose, a disaccharide. (In the body, sucrose hydrolyses into fructose and glucose.) Other disaccharides include maltose and lactose. Longer chains of sugars are called oligosaccharides. Chemically-different substances may also have a sweet taste, but are not classified as sugars. Some are used as lower-calorie food substitutes for sugar described as artificial sweeteners.\nSugars are found in the tissues of most plants, but are only present in sufficient concentrations for efficient extraction in sugarcane and sugar beet. Sugarcane is any of several species of giant grass in the genus Saccharum that have been cultivated in tropical climates in South Asia and Southeast Asia since ancient times. A great expansion in its production took place in the 18th century with the layout of sugar plantations in the West Indies and Americas. This was the first time that sugar became available to the common people who previously had to rely on honey to sweeten foods. Sugar beet, a cultivated variety of Beta vulgaris, is grown as a root crop in cooler climates and became a major source of sugar in the 19th century when methods for extracting the sugar became available. Sugar production and trade have changed the course of human history in many ways. It influenced the formation of colonies, the perpetuation of slavery, the transition to indentured labour, the migration of peoples, wars between sugar trade-controlling nations in the 19th century, and the ethnic composition and political structure of the new world.\nThe world produced about 168 million tonnes of sugar in 2011. The average person consumes about 24 kilograms of sugar each year (33.1 kg in industrialised countries), equivalent to over 260 food calories per person, per day.\nSince the latter part of the twentieth century, it has been questioned whether a diet high in sugars, especially refined sugars, is good for human health. Sugar has been linked to obesity, and suspected of, or fully implicated as a cause in the occurrence of diabetes, cardiovascular disease, dementia, macular degeneration, and tooth decay. Numerous studies have been undertaken to try to clarify the position, but with varying results, mainly because of the difficulty of finding populations for use as controls that do not consume, or are largely free of any sugar consumption."
  },
  {
  "name":"Egg white",
  "type":"other",
  "description":"Egg white is the common name for the clear liquid (also called the albumen or the glair/glaire) contained within an egg. In chickens it is formed from the layers of secretions of the anterior section of the hen's oviduct during the passage of the egg. It forms around either fertilized or unfertilized egg yolks. The primary natural purpose of egg white is to protect the yolk and provide additional nutrition for the growth of the embryo (when fertilized). Egg white consists primarily of about 90% water into which is dissolved 10% proteins (including albumins, mucoproteins, and globulins). Unlike the yolk, which is high in lipids (fats), egg white contains almost no fat, and carbohydrate content is less than 1%. Egg whites contain just over 50% of the protein in the egg. Egg white has many uses in food (e.g. mousse) and also many other uses (e.g. in the preparation of vaccines such as those for influenza)."
  },
  {
  "name":"Brown sugar",
  "type":"other",
  "description":"Brown sugar is a sucrose sugar product with a distinctive brown color due to the presence of molasses. It is either an unrefined or partially refined soft sugar consisting of sugar crystals with some residual molasses content, or it is produced by the addition of molasses to refined white sugar (so-called Molasses Sugar).\nBrown sugar contains from 3.5% molasses (light brown sugar) to 6.5% molasses (dark brown sugar) based on total volume. Based on total weight, regular brown sugar contains up to 10% molasses. The product is naturally moist from the hygroscopic nature of the molasses and is often labelled as \"soft.\" The product may undergo processing to give a product that flows better for industrial handling. The addition of dyes and/or other chemicals may be permitted in some areas or for industrial products.\nParticle size is variable but generally less than granulated white sugar. Products for industrial use (e.g., the industrial production of cakes) may be based on caster sugar which has crystals of approximately 0.35 mm.\n\n"
  },
  {
  "name":"Orange juice",
  "type":"mixer",
  "description":"Orange juice is juice from oranges. It is made by squeezing the fresh orange, by drying and later re-hydrating the juice, or by concentration of the juice and later adding water to the concentrate. It is known for its health benefits, particularly its high concentration of vitamin C. It comes in several different varieties, including blood orange. In American English, the slang term O.J. may also be used to refer to orange juice.\nDue to the importance of oranges to the economy of the state of Florida, \"the juice obtained from mature oranges of the species Citrus sinensis and hybrids thereof\" was adopted as the official beverage of Florida in 1967."
  },
  {
  "name":"Bénédictine",
  "type":"liqueur",
  "description":"Bénédictine is an herbal liqueur beverage developed by Alexandre Le Grand in the 19th century and produced in France.\nIt is claimed that at the Benedictine Abbey of Fécamp in Normandy, monks had developed a medicinal aromatic herbal beverage which was produced until the abbey's devastation during the French Revolution, but in fact Alexandre Le Grand invented the recipe himself, helped by a local chemist, and he told this story to connect the liqueur with the city history to increase sales.\nHe began production under the trade name \"Bénédictine\", using a bottle with an easily recognizable shape and label. The family eventually sold the company to Martini and Rossi, which was in turn bought by Bacardi.\nThe recipe is a closely guarded trade secret, purportedly known to only three people at any given time. So many people have tried to reproduce it that the company maintains on its grounds in Fécamp a \"Hall of Counterfeits\" (Salle des Contrefaçons). The bottle and label have been imitated, as has the name Bénédictine. The company prosecuted those it felt to be infringing on its intellectual property.\nThe manufacturing process involves several distillations which are then blended.\nThe same company also produces \"B & B\" (or Bénédictine and Brandy), which is Bénédictine diluted with brandy, making it less sweet than Bénédictine. B & B was developed in the 1930s when consumers began a trend of mixing Bénédictine with brandy to produce a drier taste. Both Bénédictine and B&B are 40% alcohol (80 proof) by volume. Until recently, both Bénédictine and B & B were 43% alcohol (86 proof). In 1977, the company introduced a 60 proof (30% alcohol) coffee liqueur, Café Bénédictine, a blend of Bénédictine and a coffee-flavoured liqueur, however, Café Bénédictine is no longer produced or available. Additionally, the company produces a Bénédictine Single Cask. Bénédictine Single Cask comes in a unique black bottle and is only available at the Palais de la Bénédictine's store in Fécamp, Normandy, France.\nEvery bottle of Bénédictine has the initials D.O.M. on the label, which stands for Deo Optimo Maximo ('To God, most good, most great'). This abbreviation is commonly used at the beginning of documents of the Benedictine Order as a short dedication of the work.\nBurnley Miners' Club in Lancashire, United Kingdom is the world's biggest single consumer of Benedictine liqueur, after Lancashire regiments acquired a taste for it during the First World War. Burnley Football Club also sell Benedictine on match days, making them the only English club to do this.\nBesides the B & B, cocktails using Bénédictine include the Frisco, Derby, Singapore Sling, Vieux Carré, Cornell Special, and Monte Carlo."
  },
  {
  "name":"Red chili peppers",
  "type":"other",
  "description":"The chili pepper (also chile pepper or chilli pepper, from Nahuatl chīlli [ˈt͡ʃiːlːi]) is the fruit of plants from the genus Capsicum, members of the nightshade family, Solanaceae. In Britain, Australia, New Zealand, India, Malaysia and other Asian countries, the word \"pepper\" is usually omitted.\nThe substances that give chili peppers their intensity when ingested or applied topically are capsaicin (8-methyl-N-vanillyl-6-nonenamide) and several related chemicals, collectively called capsaicinoids.\nChili peppers originated in the Americas. After the Columbian Exchange, many cultivars of chili pepper spread across the world, used in both food and medicine. Chilies were brought to Asia by Portuguese navigators during the 16th century.\nIndia is the world's largest producer, consumer and exporter of chili peppers. Guntur in Andhra Pradesh produces 30% of all the chilies produced in India, and the state of Andhra Pradesh as a whole contributes 75% of India's chili exports.\n\n"
  },
  {
  "name":"Egg yolk",
  "type":"other",
  "description":"The yolk is a part of an egg (or just of the egg cell in non-egg-laying animals) that feeds the developing embryo in animals. In whole eggs, 10% of the protein comes from the yolk.\nAlso known as deutoplasm, this food material is accumulated during oogenesis, together with RNA molecules and other substances. These may be synthesized by the oocyte itself or by the cytoplasm of other non-germ cells. The amount of yolk in an egg cell affects the developmental processes that follow fertilization, like the cleavage.\nApart from animals, other organisms, like algae, specially in the oogamous, can also accumulate resources in their female gametes. In gymnosperms, the remains of the female gametophyte serve also as food supply, and in flowering plants, the endosperm.\n\n"
  },
  {
  "name":"Olive juice",
  "type":"garnish",
  "description":""
  },
  {
  "name":"Dark rum",
  "type":"spirit",
  "description":"Rum is a distilled alcoholic beverage made from sugarcane byproducts, such as molasses, or directly from sugarcane juice, by a process of fermentation and distillation. The distillate, a clear liquid, is then usually aged in oak barrels. Rum can be referred to in Spanish by descriptors such as ron viejo (\"old rum\") and ron añejo (\"aged rum\").\nThe majority of the world's rum production occurs in the Caribbean and Latin America. Rum is also produced in Austria, Spain, Australia, New Zealand, Fiji, Mexico, Hawaii, the Philippines, India, Reunion Island, Mauritius, South Africa, Taiwan, Japan, the United States and Canada.\nLight rums are commonly used in cocktails, whereas \"golden\" and \"dark\" rums were typically consumed individually (i.e., \"straight\" or \"neat\") or used for cooking, but are now commonly consumed with mixers. Premium rums are also available, made to be consumed either straight or iced.\nRum plays a part in the culture of most islands of the West Indies as well as in the Canadian Maritimes and Newfoundland. This beverage has famous associations with the Royal Navy (where it was mixed with water or beer to make grog) and piracy (where it was consumed as bumbo). Rum has also served as a popular medium of economic exchange, used to help fund enterprises such as slavery, organized crime, and military insurgencies (e.g., the American Revolution and Australia's Rum Rebellion). See Triangular trade.\n\n"
  },
  {
  "name":"Pimm's No. 1",
  "type":"liqueur",
  "description":"Pimm's is a brand of fruit cups, but may also be considered a liqueur. It was first produced in 1823 by James Pimm and has been owned by Diageo since 1997. Its most popular product is Pimm's No. 1 Cup."
  },
  {
  "name":"Red Port",
  "type":"liqueur",
  "description":"The Red Sea Port Authority is responsible for the operation of several ports located along the coast of the Red Sea."
  },
  {
  "name":"Rhum Agricole",
  "type":"spirit",
  "description":"Rhum Agricole is the French term for cane juice rum, a style of rum originally distilled in the French West Indies islands from freshly squeezed sugar cane juice rather than molasses. Cane juice rums are made throughout the Caribbean, including Trinidad, Panama and the Dominican Republic. Most rum is made from molasses, a byproduct of sugar refining but when France began to make sugar from sugar beets, sugar prices plunged heavily. The debt ridden sugar factories could not survive solely on sugar production. The French islands found that fresh cane juice was available for fermenting and distilling into rum.\nMuch cane juice rum comes from Haiti (Barbancourt) Martinique and Marie-Galante, Grande-Terre, and Basse-Terre located in the Guadeloupe Islands, though other islands in the Caribbean, including Trinidad, Panama, the Dominican Republic, and Grenada also produce it. Reunion Island and Mauritius, in the Indian Ocean, also produce cane juice rum (aka rhum agricole).\nCane juice rums from Martinique are labeled \"AOC Rhum Agricole Martinique\" because French and European law allowed a designation called \"Appellation d’Origine Contrôlée\" (protected designation of origin) of \"rhum agricole AOC Martinique\" for rums produced on the island of Martinique that meet certain local standards. This designation is local peculiar to Martinique, and does not define the category of cane juice rum or rhum agricole. It is the main ingredient in Ti'Punch.\nIn Martinique, AOC labeled cane juice rums are usually distilled to 70% alcohol (140 proof in the U.S.) and then watered down to 40–55% (80–110 proof) when bottled. It may be aged as little as a few months (3 months at least for AOC rhum agricole) or for a few years. After three years of aging in oak barrels, it may be called \"rhum vieux,\" or \"old rhum\".\nFourteen distilleries in Martinique produce rhum agricole. The most renowned include Clément Estate in Le Francois, DePaz Distillery in Saint-Pierre, and Saint James Distillery and Museum in Sainte-Marie.[1]\nThe archipelago of Guadeloupe is often listed as one of the best rhum destinations, where the rhum is appreciated for its signature flavor. There are nine distilleries in Guadeloupe Islands and centuries old traditions are still used in distillation to produce multi-awarded labels. In Basse-Terre you will find Domaine de Severin, Distillerie Bologne, Distillerie Longueteau and Distillerie Reimonenq(where the Musée du Rhum is located); In Grande-Terre there is Distillerie Damoiseau; and in Marie-Galante there are Distillerie Bellevue, Distillerie Bielle and Distillerie Poisson (also known as Rhum du Père LaBat).\nThe rest of the Caribbean produces cane juice rums of varying ages. Most notable are the Barbancourt rums of Haiti which are aged to four, eight and fifteen years. A form of cane juice rum first appeared in Brazil where it is called cachaca, see below."
  },
  {
  "name":"Half egg white",
  "type":"other",
  "description":"Egg allergy is a type of food allergy. It is a hypersensitivity to dietary substances from the yolk or whites of eggs, causing an overreaction of the immune system which may lead to severe physical symptoms for millions of people around the world.\nEgg allergy appears mainly, but not exclusively, in children. In fact, it is the second most common food allergy in children. (The most common is cows' milk allergy.) It is usually treated with an exclusion diet and vigilant avoidance of foods that may be contaminated with egg. The most severe food allergy reaction is called anaphylaxis and is an emergency situation requiring immediate attention and treatment with epinephrine. The Asthma and Allergy Foundation of America estimates that most children outgrow egg allergy by the age of five, but some people remain allergic for a lifetime.\n\n"
  },
  {
  "name":"Lemonade",
  "type":"mixer",
  "description":"Lemonade is a lemon-flavored drink sweetened with sugar. In different parts of the world, there are variations on the drink and its name. Pink lemonade and frozen lemonade are also prepared. Limeade substitutes out the lemons for limes.\nIn North America, lemonade is usually made from lemon juice, water, and sugar and is often home-made.\nIn the United Kingdom and some other English-speaking countries, lemonade is a commercially-produced, lemon-flavored, carbonated, sweetened soft drink (similar to lemon-lime sodas in North America without the lime). Although lemonade is usually non-alcoholic, in recent years alcoholic versions of lemonade (called \"hard lemonade\") have become popular in various countries.\n\n"
  },
  {
  "name":"Triple Sec",
  "type":"liqueur",
  "description":"Triple sec, originally Curaçao triple sec, is a variety of Curaçao liqueur, an orange-flavoured liqueur made from the dried peels of bitter and sweet orange.\nTriple sec may be consumed neat as a digestif or on the rocks, but is more likely to be used as an ingredient in a variety of cocktails such as the Margarita, White Lady, Long Island Iced Tea, and Cosmopolitan."
  },
  {
  "name":"Mint leaves",
  "type":"garnish",
  "description":"Mentha (also known as mint, from Greek míntha, Linear B mi-ta) is a genus of plants in the family Lamiaceae (mint family). The species are not clearly distinct and estimates of the number of species varies from 13 to 18. Hybridization between some of the species occurs naturally. Many other hybrids, as well as numerous cultivars, are known in cultivation.\nThe genus has a subcosmopolitan distribution across Europe, Africa, Asia, Australia, and North America.\nMints are aromatic, almost exclusively perennial, rarely annual, herbs. They have wide-spreading underground and overground stolons and erect, square, branched stems. The leaves are arranged in opposite pairs, from oblong to lanceolate, often downy, and with a serrated margin. Leaf colors range from dark green and gray-green to purple, blue, and sometimes pale yellow. The flowers are white to purple and produced in false whorls called verticillasters. The corolla is two-lipped with four subequal lobes, the upper lobe usually the largest. The fruit is a nutlet, containing one to four seeds.\nWhile the species that make up the Mentha genus are widely distributed and can be found in many environments, most grow best in wet environments and moist soils. Mints will grow 10–120 cm tall and can spread over an indeterminate area. Due to their tendency to spread unchecked, some mints are considered invasive."
  },
  {
  "name":"Soda water",
  "type":"mixer",
  "description":"Carbonated water (also known as club soda, soda water, sparkling water, seltzer water (and Selters), or fizzy water) is water into which carbon dioxide gas under pressure has been dissolved. This process, known as carbonation, is a process that causes the water to become effervescent. For people who enjoy drinking soft drinks, carbonated water can provide a calorie- and sugar-free substitute. The vast majority of carbonated water are sold in ready to drink bottles like mineral water or carbonated beverages such as soft drinks, but it is easy to prepare at home with soda makers."
  },
  {
  "name":"Amaretto",
  "type":"liqueur",
  "description":"Amaretto is a sweet, almond-flavoured, Italian liqueur. It is made from a base of apricot pits or almonds, sometimes both."
  },
  {
  "name":"Port",
  "type":"liqueur",
  "description":"A port is a location on a coast or shore containing one or more harbors where ships can dock and transfer people or cargo to or from land. Port locations are selected to optimize access to land and navigable water, for commercial demand, and for shelter from wind and waves. Ports with deeper water are rarer, but can handle larger, more economical ships. Since ports throughout history handled every kind of traffic, support and storage facilities vary widely, may extend for miles, and dominate the local economy. Some ports have an important military role."
  }
  ]